--------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Nico Voigtländer\Dropbox\dark side social capital\Replication\Log_Bowling_JPE_Panel.txt
  log type:  text
 opened on:  28 Oct 2015, 15:43:29

. 
. ********************************************* Generate variables ****************************************************
. 
. quietly{

. 
. *
. 
. 
. 
. 
. ////////////////////////////////////////////////// Tables 6 -- Panel Results ///////////////////////////////////////////////////                
> 
. *Table 6
. eststo clear

. xtset entry_year
       panel variable:  entry_year (balanced)

. /*1*/eststo: areg entry_growth pc_cum_entry_FU_lag i_cumLagEntry_clubs dummy_year*, abs(cityid) cl(cityid), if entry_year<33
note: dummy_year8 omitted because of collinearity
note: dummy_year9 omitted because of collinearity
note: dummy_year1 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =       1200
                                                  F(   8,    218) =      44.85
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.4624
                                                  Adj R-squared   =     0.3375
                                                  Root MSE        =     0.4065

                                      (Std. Err. adjusted for 219 clusters in cityid)
-------------------------------------------------------------------------------------
                    |               Robust
       entry_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
pc_cum_entry_FU_lag |  -.6110662   .0863246    -7.08   0.000    -.7812037   -.4409286
i_cumLagEntry_clubs |   .0355019   .0183418     1.94   0.054     -.000648    .0716518
        dummy_year1 |          0  (omitted)
        dummy_year2 |  -.6597066   .1008083    -6.54   0.000    -.8583902    -.461023
        dummy_year3 |  -.8530648   .0867287    -9.84   0.000    -1.023999   -.6821308
        dummy_year4 |  -.8204569   .0830482    -9.88   0.000    -.9841371   -.6567767
        dummy_year5 |  -.7134253    .078942    -9.04   0.000    -.8690125   -.5578382
        dummy_year6 |  -.1813773    .083745    -2.17   0.031    -.3464307   -.0163238
        dummy_year7 |  -.0761362   .0595943    -1.28   0.203     -.193591    .0413186
        dummy_year8 |          0  (omitted)
        dummy_year9 |          0  (omitted)
              _cons |    1.21145   .0852037    14.22   0.000     1.043522    1.379378
--------------------+----------------------------------------------------------------
             cityid |   absorbed                                     (219 categories)
(est1 stored)

.         *Standardized coefficients
.         sum entry_growth clubs_all_pc pc_cum_entry_FU_lag if e(sample)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
entry_growth |      1200    .5328638    .4994762          0   2.946457
clubs_all_pc |      1200    2.468002    1.554977   .0206492   8.531761
pc_cum_ent~g |      1200    .5284594    .6847283   .0030286   5.760437

.         display(.0355019*1.554977*.5284594)  //standardized effect: coeff(interaction)*std(clubs)*(avg lagged cum entry pc)
.02917341

.         display(.0355019*1.554977*.5284594/.5328638) //standardized effect, relative to avg. entry growth: coeff(interaction)*std(clubs)*(avg lagged cum entry pc)
> /mean(entry_growth)
.05474834

. /*2*/eststo: areg entry_growth pc_cum_entry_FU_lag i_cumLagEntry_clubs dummy_year* i_lnpop25_cel-i_KPD_votes_avg_cel, abs(cityid) cl(cityid), if entry_year<33
note: dummy_year8 omitted because of collinearity
note: dummy_year9 omitted because of collinearity
note: dummy_year1 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =       1146
                                                  F(  23,    205) =      16.96
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.4828
                                                  Adj R-squared   =     0.3542
                                                  Root MSE        =     0.4014

                                              (Std. Err. adjusted for 206 clusters in cityid)
---------------------------------------------------------------------------------------------
                            |               Robust
               entry_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
        pc_cum_entry_FU_lag |  -1.149161   .4959454    -2.32   0.021    -2.126969   -.1713532
        i_cumLagEntry_clubs |   .0416692   .0225819     1.85   0.066    -.0028535    .0861918
                dummy_year1 |          0  (omitted)
                dummy_year2 |  -.7777496   .1136561    -6.84   0.000    -1.001834   -.5536648
                dummy_year3 |  -.9703536   .1024856    -9.47   0.000    -1.172415   -.7682927
                dummy_year4 |  -.9357456   .0969265    -9.65   0.000    -1.126846    -.744645
                dummy_year5 |  -.8161533   .0917663    -8.89   0.000    -.9970801   -.6352266
                dummy_year6 |  -.2746708   .0919221    -2.99   0.003    -.4559047   -.0934369
                dummy_year7 |  -.1402385   .0632726    -2.22   0.028    -.2649869   -.0154901
                dummy_year8 |          0  (omitted)
                dummy_year9 |          0  (omitted)
              i_lnpop25_cel |  -.0059508   .0344706    -0.17   0.863    -.0739132    .0620116
         i_share_cath25_cel |  -.1730802   .2059698    -0.84   0.402    -.5791709    .2330105
            i_bcollar25_cel |  -.7426079   .4423953    -1.68   0.095    -1.614836    .1296201
          i_share_jew25_cel |   5.089805    3.07091     1.66   0.099     -.964812    11.14442
              i_unemp33_cel |   .1949451   .6670801     0.29   0.770    -1.120272    1.510163
   i_in_welfare_per1000_cel |   .0005743   .0030087     0.19   0.849    -.0053576    .0065062
          i_war_per1000_cel |  -.0345914   .0148548    -2.33   0.021    -.0638791   -.0053036
i_sozialrentner_per1000_cel |   .0038675   .0079969     0.48   0.629    -.0118992    .0196342
           i_logtaxpers_cel |  -.0276085   .1164069    -0.24   0.813    -.2571168    .2018997
           i_logtaxprop_cel |   .0751615   .0849096     0.89   0.377    -.0922465    .2425696
i_hitler_speech_per1000_cel |   .1769275   .1332609     1.33   0.186    -.0858101    .4396651
       i_DNVP_votes_avg_cel |   .0056771   .0045983     1.23   0.218    -.0033889     .014743
        i_DVP_votes_avg_cel |   .0002722   .0057848     0.05   0.963    -.0111331    .0116775
        i_SPD_votes_avg_cel |    .007856   .0051559     1.52   0.129    -.0023093    .0180214
        i_KPD_votes_avg_cel |   .0029368   .0079209     0.37   0.711      -.01268    .0185535
                      _cons |   1.345491   .1001536    13.43   0.000     1.148028    1.542955
----------------------------+----------------------------------------------------------------
                     cityid |   absorbed                                     (206 categories)
(est2 stored)

.         *Standardized coefficients
.         sum entry_growth clubs_all_pc pc_cum_entry_FU_lag if e(sample)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
entry_growth |      1146    .5306739    .4994373          0   2.946457
clubs_all_pc |      1146    2.499557    1.563188   .0206492   8.531761
pc_cum_ent~g |      1146    .5342763     .686941   .0030286   5.760437

.         display(.0416692*1.563188*.5342763)
.03480104

.         display(.0416692*1.563188*.5342763/.5306739 )
.06557896

. *Early entries
. /*3*/eststo: areg entry_growth pc_cum_entry_FU_lag i_cumLagEntry_clubs dummy_year*, abs(cityid) cl(cityid), if entry_year<29
note: dummy_year4 omitted because of collinearity
note: dummy_year5 omitted because of collinearity
note: dummy_year6 omitted because of collinearity
note: dummy_year7 omitted because of collinearity
note: dummy_year8 omitted because of collinearity
note: dummy_year9 omitted because of collinearity
note: dummy_year1 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =        404
                                                  F(   4,    154) =      10.18
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.5170
                                                  Adj R-squared   =     0.2055
                                                  Root MSE        =     0.3496

                                      (Std. Err. adjusted for 155 clusters in cityid)
-------------------------------------------------------------------------------------
                    |               Robust
       entry_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
pc_cum_entry_FU_lag |  -4.235479   1.189199    -3.56   0.000    -6.584728    -1.88623
i_cumLagEntry_clubs |   .6112715   .1976177     3.09   0.002       .22088    1.001663
        dummy_year1 |          0  (omitted)
        dummy_year2 |  -.0419635   .0897579    -0.47   0.641    -.2192791    .1353521
        dummy_year3 |  -.1287607    .055079    -2.34   0.021    -.2375687   -.0199527
        dummy_year4 |          0  (omitted)
        dummy_year5 |          0  (omitted)
        dummy_year6 |          0  (omitted)
        dummy_year7 |          0  (omitted)
        dummy_year8 |          0  (omitted)
        dummy_year9 |          0  (omitted)
              _cons |   .8270665   .1385682     5.97   0.000     .5533267    1.100806
--------------------+----------------------------------------------------------------
             cityid |   absorbed                                     (155 categories)
(est3 stored)

.         *Standardized coefficients
.         sum entry_growth clubs_all_pc pc_cum_entry_FU_lag if e(sample)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
entry_growth |       404    .3421545    .3921941          0   2.397895
clubs_all_pc |       404    2.390954    1.583836   .0206492   8.531761
pc_cum_ent~g |       404    .1848671    .2480621   .0030286   2.240478

.         display(.6112715*1.583836*.1848671)
.17897979

.         display(.6112715*1.583836*.1848671/.3421545)
.5230964

. /*4*/eststo: areg entry_growth pc_cum_entry_FU_lag i_cumLagEntry_clubs dummy_year* i_lnpop25_cel-i_KPD_votes_avg_cel, abs(cityid) cl(cityid), if entry_year<29
note: dummy_year4 omitted because of collinearity
note: dummy_year5 omitted because of collinearity
note: dummy_year6 omitted because of collinearity
note: dummy_year7 omitted because of collinearity
note: dummy_year8 omitted because of collinearity
note: dummy_year9 omitted because of collinearity
note: dummy_year1 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =        389
                                                  F(  19,    148) =       7.65
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.5636
                                                  Adj R-squared   =     0.2339
                                                  Root MSE        =     0.3466

                                              (Std. Err. adjusted for 149 clusters in cityid)
---------------------------------------------------------------------------------------------
                            |               Robust
               entry_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
        pc_cum_entry_FU_lag |   4.877782   9.347995     0.52   0.603      -13.595    23.35057
        i_cumLagEntry_clubs |   .6131744   .3237283     1.89   0.060    -.0265524    1.252901
                dummy_year1 |          0  (omitted)
                dummy_year2 |  -.1156214   .1046476    -1.10   0.271    -.3224179    .0911751
                dummy_year3 |  -.1501028   .0597268    -2.51   0.013    -.2681302   -.0320753
                dummy_year4 |          0  (omitted)
                dummy_year5 |          0  (omitted)
                dummy_year6 |          0  (omitted)
                dummy_year7 |          0  (omitted)
                dummy_year8 |          0  (omitted)
                dummy_year9 |          0  (omitted)
              i_lnpop25_cel |  -.9100974    .689413    -1.32   0.189    -2.272462    .4522672
         i_share_cath25_cel |  -1.909621   4.444148    -0.43   0.668     -10.6918     6.87256
            i_bcollar25_cel |  -.2649605   7.269504    -0.04   0.971    -14.63039    14.10047
          i_share_jew25_cel |   42.06641   54.40645     0.77   0.441     -65.4474    149.5802
              i_unemp33_cel |   -2.45451   16.59225    -0.15   0.883    -35.24284    30.33382
   i_in_welfare_per1000_cel |   .0865207   .0473701     1.83   0.070    -.0070884    .1801298
          i_war_per1000_cel |  -.1349569   .2125398    -0.63   0.526    -.5549616    .2850478
i_sozialrentner_per1000_cel |  -.1446305     .13323    -1.09   0.279    -.4079092    .1186483
           i_logtaxpers_cel |   2.461539   2.207603     1.12   0.267    -1.900956    6.824033
           i_logtaxprop_cel |  -.5623026   1.492215    -0.38   0.707    -3.511102    2.386497
i_hitler_speech_per1000_cel |   5.363854   2.361981     2.27   0.025     .6962902    10.03142
       i_DNVP_votes_avg_cel |  -.0736174    .088869    -0.83   0.409    -.2492333    .1019986
        i_DVP_votes_avg_cel |   -.135867   .1187098    -1.14   0.254     -.370452    .0987181
        i_SPD_votes_avg_cel |  -.0482028   .1240068    -0.39   0.698    -.2932554    .1968497
        i_KPD_votes_avg_cel |   .0088692   .1124271     0.08   0.937    -.2133005    .2310388
                      _cons |   .9796318   .1698082     5.77   0.000       .64407    1.315194
----------------------------+----------------------------------------------------------------
                     cityid |   absorbed                                     (149 categories)
(est4 stored)

.         *Standardized coefficients
.         sum entry_growth clubs_all_pc pc_cum_entry_FU_lag if e(sample)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
entry_growth |       389    .3437975    .3960018          0   2.397895
clubs_all_pc |       389    2.433012    1.590072   .0206492   8.531761
pc_cum_ent~g |       389    .1855974    .2491117   .0030286   2.240478

.         display(.6131744*1.590072*.1855974)
.18095588

.         display(.6131744*1.590072*.1855974/.3437975)
.52634437

. *Late entries
. /*5*/eststo: areg entry_growth pc_cum_entry_FU_lag i_cumLagEntry_clubs dummy_year*, abs(cityid) cl(cityid), if entry_year>=29 & entry_year<33
note: dummy_year1 omitted because of collinearity
note: dummy_year2 omitted because of collinearity
note: dummy_year3 omitted because of collinearity
note: dummy_year4 omitted because of collinearity
note: dummy_year8 omitted because of collinearity
note: dummy_year9 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =        796
                                                  F(   5,    218) =      50.37
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.5106
                                                  Adj R-squared   =     0.3198
                                                  Root MSE        =     0.4289

                                      (Std. Err. adjusted for 219 clusters in cityid)
-------------------------------------------------------------------------------------
                    |               Robust
       entry_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
pc_cum_entry_FU_lag |  -.6925118   .0988637    -7.00   0.000    -.8873628   -.4976607
i_cumLagEntry_clubs |   .0511185   .0193369     2.64   0.009     .0130073    .0892296
        dummy_year1 |          0  (omitted)
        dummy_year2 |          0  (omitted)
        dummy_year3 |          0  (omitted)
        dummy_year4 |          0  (omitted)
        dummy_year5 |  -.7611434   .0904646    -8.41   0.000    -.9394406   -.5828463
        dummy_year6 |  -.2254748   .0963318    -2.34   0.020    -.4153356    -.035614
        dummy_year7 |  -.1044088   .0674106    -1.55   0.123    -.2372687    .0284511
        dummy_year8 |          0  (omitted)
        dummy_year9 |          0  (omitted)
              _cons |     1.2598   .0980678    12.85   0.000     1.066518    1.453082
--------------------+----------------------------------------------------------------
             cityid |   absorbed                                     (219 categories)
(est5 stored)

.         *Standardized coefficients
.         sum entry_growth clubs_all_pc pc_cum_entry_FU_lag if e(sample)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
entry_growth |       796     .629656    .5200185          0   2.946457
clubs_all_pc |       796    2.507107    1.539653   .0206492   8.531761
pc_cum_ent~g |       796    .7028454    .7651652   .0166547   5.760437

.         display(.0511185*1.539653*.7028454)
.05531727

.         display(.0511185*1.539653*.7028454/.629656)
.08785317

. /*6*/eststo: areg entry_growth pc_cum_entry_FU_lag i_cumLagEntry_clubs dummy_year* i_lnpop25_cel-i_KPD_votes_avg_cel, abs(cityid) cl(cityid), if entry_year>=29 & 
> entry_year<33
note: dummy_year1 omitted because of collinearity
note: dummy_year2 omitted because of collinearity
note: dummy_year3 omitted because of collinearity
note: dummy_year4 omitted because of collinearity
note: dummy_year8 omitted because of collinearity
note: dummy_year9 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =        757
                                                  F(  20,    205) =      15.68
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.5414
                                                  Adj R-squared   =     0.3470
                                                  Root MSE        =     0.4200

                                              (Std. Err. adjusted for 206 clusters in cityid)
---------------------------------------------------------------------------------------------
                            |               Robust
               entry_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
        pc_cum_entry_FU_lag |  -.8973338   .6134035    -1.46   0.145    -2.106722    .3120546
        i_cumLagEntry_clubs |   .0547217   .0265811     2.06   0.041     .0023142    .1071292
                dummy_year1 |          0  (omitted)
                dummy_year2 |          0  (omitted)
                dummy_year3 |          0  (omitted)
                dummy_year4 |          0  (omitted)
                dummy_year5 |  -.8751505    .105596    -8.29   0.000    -1.083344    -.666957
                dummy_year6 |  -.3310655    .106057    -3.12   0.002    -.5401678   -.1219631
                dummy_year7 |  -.1758338   .0712296    -2.47   0.014    -.3162703   -.0353974
                dummy_year8 |          0  (omitted)
                dummy_year9 |          0  (omitted)
              i_lnpop25_cel |  -.0197931   .0405458    -0.49   0.626    -.0997335    .0601472
         i_share_cath25_cel |  -.2817976   .2484058    -1.13   0.258    -.7715553    .2079602
            i_bcollar25_cel |  -1.291364    .557396    -2.32   0.022    -2.390327   -.1923995
          i_share_jew25_cel |   5.356683   4.064395     1.32   0.189    -2.656692    13.37006
              i_unemp33_cel |   .6818243   .8499896     0.80   0.423    -.9940182    2.357667
   i_in_welfare_per1000_cel |    .000398   .0036716     0.11   0.914    -.0068409    .0076368
          i_war_per1000_cel |  -.0324913   .0225612    -1.44   0.151     -.076973    .0119905
i_sozialrentner_per1000_cel |   .0034309   .0099486     0.34   0.731    -.0161839    .0230456
           i_logtaxpers_cel |  -.0155262    .151658    -0.10   0.919    -.3145357    .2834833
           i_logtaxprop_cel |   .0648542   .1106925     0.59   0.559    -.1533875     .283096
i_hitler_speech_per1000_cel |   .3521667   .1663039     2.12   0.035     .0242814     .680052
       i_DNVP_votes_avg_cel |   .0076493   .0061184     1.25   0.213    -.0044137    .0197123
        i_DVP_votes_avg_cel |  -.0082701    .006416    -1.29   0.199    -.0209199    .0043797
        i_SPD_votes_avg_cel |   .0101906   .0068503     1.49   0.138    -.0033153    .0236966
        i_KPD_votes_avg_cel |   .0076166   .0119182     0.64   0.523    -.0158814    .0311145
                      _cons |   1.404942   .1127245    12.46   0.000     1.182694     1.62719
----------------------------+----------------------------------------------------------------
                     cityid |   absorbed                                     (206 categories)
(est6 stored)

.         *Standardized coefficients
.         sum entry_growth clubs_all_pc pc_cum_entry_FU_lag if e(sample)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
entry_growth |       757    .6267041    .5197108          0   2.946457
clubs_all_pc |       757    2.533752    1.549139   .0206492   8.531761
pc_cum_ent~g |       757    .7134521    .7669061   .0166547   5.760437

.         display(.0547217*1.549139*.7134521)
.06048042

.         display(.0547217*1.549139*.7134521/.6267041)
.09650554

. 
. ******************************************************************************************************************************************
. 
. log close
      name:  <unnamed>
       log:  C:\Users\Nico Voigtländer\Dropbox\dark side social capital\Replication\Log_Bowling_JPE_Panel.txt
  log type:  text
 closed on:  28 Oct 2015, 15:43:31
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
